// app/components/CoCurricularActivities.tsx
import React from "react";

const CoCurricularActivities = () => {
  return (
    <section className="post-section p-0 md:p-3">
      <div className="post-content">
        <h1 className="text-[32px] font-bold text-black leading-normal mb-4">
          সহ-পাঠক্রমিক কার্যাবলি
        </h1>

        <p className="text-lg text-justify">
          যে সমস্ত কার্যাবলি শিক্ষার্থীর মানসিক শক্তি বিকাশের সহায়ক এবং যেগুলি
          শিক্ষার্থীর সু-সামঞ্জস্যপূর্ণ ব্যক্তিত্বের বিকাশ ঘটায়, পাঠক্রমের
          সহযোগী সেইসব বিষয় বা কার্যাবলিকে বলা হয় সহ-পাঠক্রমিক কার্যাবলি।
          মনোবিদ রিভলিন (H. N. Rivlin) সহ-পাঠক্রমিক কার্যাবলির যে সংজ্ঞা
          দিয়েছেন তা হল- যে সব কার্যাবলি শিক্ষার্থীর বৌদ্ধিক বিকাশের সঙ্গে
          সঙ্গে তার সামগ্রিক জীবন বিকাশের অন্যান্য দিকে সহায়তা করে তাদেরই বলা
          হয় সহ-পাঠক্রমিক কার্যাবলি।
        </p>

        <h2 className="text-2xl font-bold text-black mt-6 mb-2">
          সহপাঠক্রমিক কার্যাবলির বৈশিষ্ট্য
        </h2>

        <ul className="space-y-4 text-lg leading-7 text-justify">
          <li>
            <strong>১) সৃজনশীল গুণাবলির বিকাশে সহায়ক:</strong> আধুনিক শিক্ষা
            ব্যবস্থার মূল লক্ষ্য শিক্ষার্থীদের মধ্যে সুপ্ত সম্ভাবনা গুলিকে
            বিকশিত করা।
          </li>
          <li>
            <strong>২) আগ্রহ সৃষ্টিকারী:</strong> সহপাঠক্রমিক কার্যাবলি
            শিক্ষার্থীদের মধ্যে বিভিন্ন কাজের প্রতি আগ্রহ সৃষ্টি করে।
          </li>
          <li>
            <strong>৩) সর্বাঙ্গীণ বিকাশে সহায়ক:</strong> শিক্ষার্থীদের দৈহিক,
            মানসিক, সামাজিক, নৈতিক বিকাশে সহায়তা করে।
          </li>
          <li>
            <strong>৪) একঘেয়েমি নিরসনে সহায়ক:</strong> পুথিগত শিক্ষার
            একঘেয়েমি দূর করে।
          </li>
          <li>
            <strong>৫) শিক্ষার্থীর চাহিদা পরিপূরণে সহায়ক:</strong> বিভিন্ন
            শিক্ষার্থীর বিশেষ চাহিদা পূরণ করে।
          </li>
          <li>
            <strong>৬) ব্যক্তি ও সমাজের মধ্যে সংযোগ সাধনকারী:</strong> সামাজিক
            সচেতনতা ও মূল্যবোধ গড়ে তোলে।
          </li>
          <li>
            <strong>৭) আনন্দদানে সহায়ক:</strong> শিক্ষার্থীদের তৃপ্তি ও আনন্দ
            দেয়।
          </li>
          <li>
            <strong>৮) জাতীয়তাবোধ বিকাশে সহায়ক:</strong> জাতীয় সংহতির বিকাশে
            সহায়তা করে।
          </li>
          <li>
            <strong>৯) আন্তর্জাতিকতাবোধের বিকাশে সহায়ক:</strong> বৈশ্বিক
            দৃষ্টিভঙ্গি তৈরি করে।
          </li>
          <li>
            <strong>১০) গণতান্ত্রিক মূল্যবোধের বিকাশে সহায়ক:</strong> দলগত
            অংশগ্রহণের মাধ্যমে গণতান্ত্রিক চেতনা গড়ে তোলে।
          </li>
        </ul>

        <h2 className="text-2xl font-bold text-black mt-6 mb-2">
          সহপাঠক্রমিক কার্যাবলির অপরিহার্যতা বিষয়ে যুক্তি
        </h2>

        <ul className="space-y-4 text-lg text-justify">
          <li>
            <strong>১) দর্শনগত যুক্তি:</strong> সক্রিয়তাভিত্তিক শিক্ষার জন্য
            সহপাঠক্রমিক কার্যাবলি অপরিহার্য।
          </li>
          <li>
            <strong>২) মনোবিজ্ঞানসম্মত যুক্তি:</strong> শিশুর সুপ্ত শক্তির
            বিকাশে সহায়ক।
          </li>
          <li>
            <strong>৩) সমাজতত্ত্বগত যুক্তি:</strong> সমাজসচেতন প্রকৃত মানুষ গড়ে
            তোলার জন্য অপরিহার্য।
          </li>
        </ul>

        <h2 className="text-2xl font-bold text-black mt-6 mb-2">
          সহপাঠক্রমিক কার্যাবলি কার্যকর করার বিষয়ে সুপারিশ
        </h2>

        <ul className="space-y-4 text-lg text-justify">
          <li>১) বিষয়টিকে মূল পাঠক্রমের অন্তর্ভুক্ত করা।</li>
          <li>
            ২) অভিজ্ঞ শিক্ষক নিয়োগ যারা সহপাঠক্রমিক কার্যাবলি পরিচালনা করতে
            সক্ষম।
          </li>
          <li>৩) সরকারের অতিরিক্ত অর্থ বরাদ্দ।</li>
          <li>
            ৪) শিক্ষক, অভিভাবক এবং শিক্ষার্থীদের মাঝে স্পষ্ট ধারণা গড়ে তোলা।
          </li>
        </ul>

        <p className="text-lg mt-4 text-justify">
          তাহলে আগামী দিনে সহপাঠক্রমিক কার্যাবলির ফলে ছাত্রছাত্রী এবং সমাজ
          বিশেষভাবে উপকৃত হবে। ব্যক্তি, সমাজ ও জাতির আশা-আকাঙ্ক্ষা পূর্ণ হবে।
          শিক্ষার মূল লক্ষ্য বাস্তবায়িত হবে।
        </p>
      </div>
    </section>
  );
};

export default CoCurricularActivities;
